v002-timeDependent/0/rock/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/rock";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    rock_inlet
    {
        type            calculated;
        value           uniform 100000;
    }
    rock_outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    rock_outer
    {
        type            calculated;
        value           uniform 100000;
    }
    rock_wedge1
    {
        type            wedge;
    }
    rock_wedge2
    {
        type            wedge;
    }
    rock_to_water
    {
        type            calculated;
        value           uniform 100000;
    }
}


// ************************************************************************* //
