v002-timeDependent/0/water/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
6000
(
0.0002144485
0.00021444827
0.00021444833
0.00021444852
0.00021444878
0.00021444911
0.00021444953
0.00021445001
...
)
;

boundaryField
{
    water_inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.000234375;
    }
    water_outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           nonuniform List<scalar> 
15
(
0.00018672145
0.0001901103
0.00019752285
0.00020870096
0.0002234771
0.00024161872
0.000262834
0.00028681823
0.0003133204
0.00034222574
0.0003736768
0.00040831397
0.00044786531
0.0004965542
0.0005193429
)
;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
400
(
0.00033298785
0.00042108833
0.0004915993
0.00054314021
0.00057747636
0.00059772639
0.00060724748
0.00060905754
...
)
;
    }
}


// ************************************************************************* //
