v002-timeDependent/0/water/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "30000/water";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
11585
(
-1.313792e-06
0.00048440267
-5.3280547e-06
0.0014532809
-1.2127226e-05
0.0024222435
-2.1852679e-05
0.0033913476
...
)
;

boundaryField
{
    water_inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
-0.00048308888
-0.0014492666
-0.0024154444
-0.0033816222
-0.0043477998
-0.0053139775
-0.0062801554
-0.0072463331
-0.0082125108
-0.0091786886
-0.010144866
-0.011111044
-0.012077222
-0.0130434
-0.014009577
)
;
    }
    water_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
0.00056773626
0.0017005284
0.0028242574
0.003932347
0.0050176943
0.00607249
0.007087948
0.0080537762
0.0089571678
0.009780916
0.010499737
0.011072357
0.011421733
0.011373945
0.010332364
)
;
    }
    water_wedge1
    {
        type            wedge;
        value           nonuniform List<scalar> 
6000
(
3.3178448e-15
5.6577559e-15
5.8144771e-15
5.9136968e-15
6.0697111e-15
6.1609201e-15
6.1784377e-15
6.1461431e-15
...
)
;
    }
    water_wedge2
    {
        type            wedge;
        value           nonuniform List<scalar> 
6000
(
3.3178671e-15
5.6589821e-15
5.813725e-15
5.9138216e-15
6.0766454e-15
6.1605886e-15
6.1755523e-15
6.1498208e-15
...
)
;
    }
    water_to_rock
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
