v002-timeDependent/0/water/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000/water";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 998.2;

boundaryField
{
    water_inlet
    {
        type            calculated;
        value           uniform 998.2;
    }
    water_outlet
    {
        type            calculated;
        value           uniform 998.2;
    }
    water_wedge1
    {
        type            wedge;
    }
    water_wedge2
    {
        type            wedge;
    }
    water_to_rock
    {
        type            calculated;
        value           uniform 998.2;
    }
}


// ************************************************************************* //
